app/controllers/documents_controller.rb

INSERT INTO `documents` (`name`, `created_at`, `updated_at`, `professor_id`) VALUES ('fefew', '2018-12-18 03:48:06', '2018-12-18 03:48:06', 1)
---
  def convert
    require 'docx'
    docx_document = Document.find(params[:id])

    doc_downloaded = Tempfile.new(['document', '.docx'], Rails.root.to_s + '/tmp/')
    File.open(doc_downloaded.path, "wb") do |file|
      file.write(docx_document.docfile.download)
    end

    docx = Docx::Document.open(doc_downloaded.path)
    @document = Document.new
    @document.name = docx_document.name
    #@document.description = docx.to_html

    html_doc = Tempfile.new(['document', '.html'], Rails.root.to_s + '/tmp/')
    File.open(html_doc.path, "wb") do |file|
      file.write(docx_document.description)
    end

    pdf = WickedPdf.new.pdf_from_html_file(html_doc.path)

    pdf_file = Tempfile.new(['pdf', '.pdf'], Rails.root.to_s + '/tmp/')
    File.open(pdf_file.path, "wb") do |file|
      file.write(pdf)
    end
    @document.description = docx_document.description
    @document.docfile.attach(io:File.open(pdf_file.path),
                             filename: docx_document.name,
                             content_type: "application/pdf")
    @document.professor_id = current_professor.id
    @document.save!

INSERT INTO `documents` (`name`, `created_at`, `updated_at`, `professor_id`) VALUES ('nhndfg', '2018-12-18 23:23:53', '2018-12-18 23:23:53', 1)
---

    #COMBINA PDF RECIÉN CREADO Y EL ORIGINAL
    pdf = CombinePDF.new
    pdf << CombinePDF.load(document.path)