app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents` WHERE `documents`.`professor_id` = 1
---
  def index

    #SELECT * ALL
    @professors = Professor.all.where.not(id: current_professor)
    @document = Document.new
    @documents = Document.where(professor_id: current_professor.id)

SELECT `documents`.* FROM `documents` WHERE `documents`.`id` IN (SELECT `collaborators`.`document_id` FROM `collaborators` WHERE `collaborators`.`professor_id` = 2)
---
  def allshared
    #SELECT * ALL
    @professors = Professor.all.where.not(id: current_professor)
    @document = Document.new
    @documents = Document.where(collaborators: Collaborator.where(professor_id: current_professor.id))

SELECT  `documents`.* FROM `documents` WHERE (id = '9' AND professor_id = 1) LIMIT 1
---
  def show
    #Encuentra un registro de documento por ID
     @document = Document.find_by("id = ? AND professor_id = ?", params[:id], current_professor.id)

SELECT  `documents`.* FROM `documents` WHERE (id = '3' AND professor_id = 1) LIMIT 1
SELECT  `collaborators`.* FROM `collaborators` WHERE (document_id = '49' AND professor_id = 2) LIMIT 1
---
  def shared
    #Encuentra un registro de documento por ID
     @documents = Document.where(collaborators: Collaborator.find_by("document_id = ? AND professor_id = ?", params[:id], current_professor.id))

INSERT INTO `documents` (`name`, `description`, `created_at`, `updated_at`, `professor_id`) VALUES ('dvdsvsd', '<p>fvgdfxv</p>\r\n', '2018-12-16 17:26:50', '2018-12-16 17:26:50', 1)
---
  def create
    @document = Document.new document_params
    @document.professor_id = current_professor.id
    fileDoc = Htmltoword::Document.create_and_save @document.description, 'C:\Users\zaret\Downloads\testruby\archivo.docx'
    @document.docfile.attach(io: File.open(fileDoc),
                             filename: "archivo.docx",
                             content_type: 'application/vnd.openxmlformats-officedocument.wordprocessingml.document')
    @document.save!

INSERT INTO `documents` (`name`, `created_at`, `updated_at`, `professor_id`) VALUES ('PDF', '2018-12-17 06:43:30', '2018-12-17 06:43:30', 1)
---
  def after_upload
    #render plain: params[:image].inspect
    @document = Document.new document_params
    @document.professor_id = current_professor.id
    @document.save

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 0 LIMIT 1
UPDATE `documents` SET `updated_at` = '2018-12-17 07:47:36' WHERE `documents`.`id` = 19
---
  def update
    @document = Document.find params[:id]
    @document.update documents_params

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 0 LIMIT 1
---
  def rename
    @document = Document.find params[:id]

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 8 LIMIT 1
UPDATE `documents` SET `name` = 'vvrece', `updated_at` = '2018-12-17 07:04:24' WHERE `documents`.`id` = 8
---
  def rename_upload
    @document = Document.find params[:documentid]
    @document.update document_newName

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 9 LIMIT 1
---
  def document_professor_upload
    @document = Document.find params[:documentid]

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 5 LIMIT 1
DELETE FROM `documents` WHERE `documents`.`id` = 5
---
  def destroy
    #DELETE FROM documents
    @document = Document.find(params[:id])
    @document.destroy

SELECT  `documents`.* FROM `documents` WHERE (id = '49' AND professor_id = 1) LIMIT 1
---
  def convert
    require 'docx'
    docx_document = Document.find_by("id = ? AND professor_id = ?", params[:id], current_professor.id)

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 19 LIMIT 1
---
  def sign
    @document = Document.find(params[:format])

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 19 LIMIT 1
---
  def after_sign
    require 'openssl'
    require 'origami'
    @document = Document.find params[:documentid]

INSERT INTO `documents` (`name`, `created_at`, `updated_at`, `professor_id`) VALUES ('nhndfg', '2018-12-18 01:37:02', '2018-12-18 01:37:02', 1)
---

    #COMBINA PDF RECIÉN CREADO Y EL ORIGINAL
    pdf = CombinePDF.new
    pdf << CombinePDF.load(document.path)

SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 49 LIMIT 1
---
  def validate
    @document = Document.find(params[:format])

SELECT  `professors`.* FROM `professors` WHERE `professors`.`id` = 1 LIMIT 1
---
  def generate_certificate(key)
    require 'openssl'
    professor = Professor.find(current_professor.id)