app/controllers/signatures_controller.rb

  def new
    @signature = Signature.find_by(professor_id: current_professor.id)
---
SELECT  `signatures`.* FROM `signatures` WHERE `signatures`.`professor_id` = 1 LIMIT 1

  def create
    @signature = Signature.new signature_params
    if @signature.password == @signature.confirmation
        key = OpenSSL::PKey::RSA.new 4096
        cipher = OpenSSL::Cipher.new 'AES-128-CBC'
        pass_phrase = @signature.password
        key_secure = key.export cipher, pass_phrase
        #Guarda llave pública
        public = Tempfile.new(['publickey', '.pem'])
        open public.path, 'w' do |io| io.write key.public_key end

        @signature.public_key.attach(io: File.open(public),
                                     filename: "publickey-" + current_professor.id.to_s + ".pem",
                                     content_type: 'application/x-pem-file')
        @signature.professor_id = current_professor.id
        @signature.save
---
INSERT INTO `signatures` (`created_at`, `updated_at`, `professor_id`) VALUES ('2018-12-16 20:40:30', '2018-12-16 20:40:30', 1)
INSERT INTO `signatures` (`created_at`, `updated_at`, `professor_id`) VALUES ('2018-12-18 00:33:30', '2018-12-18 00:33:30', 1)