app/models/document.rb

  def save_professors
    begin
    @professors.each do |professor_id|
      Collaborator.create(professor_id: professor_id, document_id: self.id)
---
INSERT INTO `documents` (`name`, `description`, `created_at`, `updated_at`, `professor_id`) VALUES ('gtdfgvdfs', '<p>vewcwx</p>\r\n', '2018-12-17 08:40:35', '2018-12-17 08:40:35', 1)
INSERT INTO `collaborators` (`document_id`, `professor_id`, `created_at`, `updated_at`) VALUES (9, 2, '2018-12-17 07:04:16', '2018-12-17 07:04:16')